examples/flows/compiled/async_conditional/flow.mmd
flowchart TD
    %% Flow: content_pipeline_flow

    classifier[classifier]
    end_content_pipeline_flow([end_content_pipeline_flow])
    generic_processor[generic_processor]
    image_processor[image_processor]
    quality_check[quality_check]
    router_content_pipeline_flow_line_16_if_2{{router_content_pipeline_flow_line_16_if_2}}
    router_content_pipeline_flow_line_18_if_1{{router_content_pipeline_flow_line_18_if_1}}
    start_content_pipeline_flow([start_content_pipeline_flow])
    text_processor[text_processor]

    start_content_pipeline_flow --> classifier
    classifier --> router_content_pipeline_flow_line_16_if_2
    router_content_pipeline_flow_line_18_if_1 -->|p['content_type'] == 'image'| image_processor
    router_content_pipeline_flow_line_18_if_1 -->|not (p['content_type'] == 'image')| generic_processor
    router_content_pipeline_flow_line_16_if_2 -->|p['content_type'] == 'text'| text_processor
    text_processor --> quality_check
    router_content_pipeline_flow_line_16_if_2 -->|not (p['content_type'] == 'text')| router_content_pipeline_flow_line_18_if_1
    router_content_pipeline_flow_line_18_if_1 --> quality_check
    quality_check --> end_content_pipeline_flow
